Documents/УДАЛИТЬ_Невыходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УДАЛИТЬ_Невыходы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Замеры</xr:Item>
				<xr:Item>InformationRegister.Невыходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаПродаж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Бригады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Бригада</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УДАЛИТЬ_Невыходы/Forms/ФормаПодбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.СписокСотрудников.Видимость = Ложь;
	Элементы.СписокБригад.Видимость = Ложь;
	Назначение = "Сотрудники";
	Параметры.Свойство("Назначение", Назначение);
	Если Назначение = "Сотрудники" Тогда
		Элементы.СписокСотрудников.Видимость = Истина;
	ИначеЕсли Назначение = "Бригады" Тогда
		Элементы.СписокБригад.Видимость = Истина;
	КонецЕсли;
	
	ДатаНачала = НачалоДня(ТекущаяДатаСеанса()) + 1;
	ДатаОкончания = КонецМесяца(ТекущаяДатаСеанса());	
	РежимЗаполнения = 1;
	РежимЗаполненияПриИзмененииНаСервере();
	ЧислоМесяца = 1;
	КоличествоНевыходов = 2;
	КоличествоРабочих = 2;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если ПеренестиВДокумент Тогда
		АдресТаблицыВХранилище = АдресТаблицыВХранилище(ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
	Иначе
		АдресТаблицыВХранилище = Неопределено;
	КонецЕсли;
	
	Если АдресТаблицыВХранилище <> Неопределено Тогда
		Структура = Новый Структура("ТаблицаПодбора", АдресТаблицыВХранилище);
		Структура.Вставить("Назначение", Назначение);
		Если Назначение = "Сотрудники" Тогда
			Структура.Вставить("Список", СписокСотрудников);
		ИначеЕсли Назначение = "Бригады" Тогда
			Структура.Вставить("Список", СписокБригад);
		КонецЕсли;
				
		ОповеститьОВыборе(Структура);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РежимЗаполненияПриИзменении(Элемент)
	РежимЗаполненияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РежимЗаполненияПриИзмененииНаСервере()
	
	Если РежимЗаполнения = 1 Тогда
		Элементы.ГруппаРежимыЗаполнения.ТекущаяСтраница = Элементы.ГруппаПоДнямНедели;
	ИначеЕсли РежимЗаполнения = 2 Тогда
		Элементы.ГруппаРежимыЗаполнения.ТекущаяСтраница = Элементы.ГруппаПоДнямМесяца;
	ИначеЕсли РежимЗаполнения = 3 Тогда
		Элементы.ГруппаРежимыЗаполнения.ТекущаяСтраница = Элементы.ГруппаЧередование;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена дата начала", , "ДатаНачала");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена дата окончания",,"ДатаОкончания");
		Возврат;
	КонецЕсли;
	
	КоличествоДней = (НачалоДня(ДатаОкончания)-НачалоДня(ДатаНачала))/86400 + 1;
	
	Если РежимЗаполнения = 1 Тогда
		//ПоДнямНедели
		ИтерацияДата = НачалоДня(ДатаНачала);
		Для Инд = 1 По КоличествоДней Цикл
			ИтерацияДеньНедели = ДеньНедели(ИтерацияДата);
			ИтерацияВремяС = ?(Инд = 1, Дата("00010101") + (ДатаНачала - ИтерацияДата), Дата(1,1,1,0,0,1));
			ИтерацияВремяПо = ?(Инд = КоличествоДней, Дата("00010101") + (ДатаОкончания - ИтерацияДата), Дата(1,1,1,23,59,59));
			Если ИтерацияДеньНедели = 1 И Пн Тогда
				ДобавитьСтрокуПодбора(ИтерацияДата, ИтерацияДата, ИтерацияВремяС, ИтерацияВремяПо);	
			ИначеЕсли ИтерацияДеньНедели = 2 И Вт Тогда
				ДобавитьСтрокуПодбора(ИтерацияДата, ИтерацияДата, ИтерацияВремяС, ИтерацияВремяПо);
			ИначеЕсли ИтерацияДеньНедели = 3 И Ср Тогда
				ДобавитьСтрокуПодбора(ИтерацияДата, ИтерацияДата, ИтерацияВремяС, ИтерацияВремяПо);
			ИначеЕсли ИтерацияДеньНедели = 4 И Чт Тогда
				ДобавитьСтрокуПодбора(ИтерацияДата, ИтерацияДата, ИтерацияВремяС, ИтерацияВремяПо);
			ИначеЕсли ИтерацияДеньНедели = 5 И Пт Тогда
				ДобавитьСтрокуПодбора(ИтерацияДата, ИтерацияДата, ИтерацияВремяС, ИтерацияВремяПо);
			ИначеЕсли ИтерацияДеньНедели = 6 И Сб Тогда
				ДобавитьСтрокуПодбора(ИтерацияДата, ИтерацияДата, ИтерацияВремяС, ИтерацияВремяПо);
			ИначеЕсли ИтерацияДеньНедели = 7 И Вс Тогда
				ДобавитьСтрокуПодбора(ИтерацияДата, ИтерацияДата, ИтерацияВремяС, ИтерацияВремяПо);
			КонецЕсли;
			ИтерацияДата = ИтерацияДата + 86400;
		КонецЦикла;
		
	ИначеЕсли РежимЗаполнения = 2 Тогда
		//ПоДнямМесяца
		Если НЕ ЗначениеЗаполнено(ЧислоМесяца) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указано число месяца",,"ЧислоМесяца");
			Возврат;
		КонецЕсли;
		Если (ЧислоМесяца) > 31 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недопустимое число месяца",,"ЧислоМесяца");
			Возврат;
		КонецЕсли;
		ИтерацияДата = НачалоДня(ДатаНачала);
		Для Инд = 1 По КоличествоДней Цикл
			ИтерацияЧислоМесяца = День(ИтерацияДата);
			ИтерацияВремяС = ?(Инд = 1, Дата("00010101") + (ДатаНачала - ИтерацияДата), Дата(1,1,1,0,0,1));
			ИтерацияВремяПо = ?(Инд = КоличествоДней, Дата("00010101") + (ДатаОкончания - ИтерацияДата), Дата(1,1,1,23,59,59));
			Если ИтерацияЧислоМесяца = ЧислоМесяца Тогда
				ДобавитьСтрокуПодбора(ИтерацияДата, ИтерацияДата, ИтерацияВремяС, ИтерацияВремяПо);	
			КонецЕсли;
			ИтерацияДата = ИтерацияДата + 86400;
		КонецЦикла;
		
	ИначеЕсли РежимЗаполнения = 3 Тогда
		//Чередование
		Если НЕ ЗначениеЗаполнено(КоличествоНевыходов) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указано количество невыходов",,"КоличествоНевыходов");
			Возврат;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(КоличествоРабочих) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указано количество рабочих дней",,"КоличествоРабочих");
			Возврат;
		КонецЕсли;
		ИтерацияДата = НачалоДня(ДатаНачала);
		Инд = 1;
		Пока Инд <= КоличествоДней Цикл
			ИтерацияДатаС = ИтерацияДата;
			ИтерацияДатаПо = Мин(ИтерацияДата + 86400*(КоличествоНевыходов-1), ДатаОкончания);
			
			ИтерацияВремяС = ?(Инд = 1, Дата("00010101") + (ДатаНачала - ИтерацияДата), Дата(1,1,1,0,0,1));
			ИтерацияВремяПо = ?(НачалоДня(ДатаОкончания) = НачалоДня(ИтерацияДатаПо), Дата("00010101") + (ДатаОкончания - НачалоДня(ДатаОкончания)), Дата(1,1,1,23,59,59));
			
			ДобавитьСтрокуПодбора(ИтерацияДатаС, ИтерацияДатаПо, ИтерацияВремяС, ИтерацияВремяПо);
			
			ИтерацияДата = ИтерацияДата + 86400 * (КоличествоНевыходов + КоличествоРабочих);
			Инд = Инд + КоличествоНевыходов + КоличествоРабочих; 
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуПодбора(Знач ДатаС, Знач ДатаПо, Знач ВремяС, Знач ВремяПо)
	
	СтруктураОтбора = Новый Структура("ДатаС, ДатаПо, ВремяС, ВремяПо", ДатаС, ДатаПо, ВремяС, ВремяПо);
	НайденныеСтроки = ТаблицаПодбора.НайтиСтроки(СтруктураОтбора);
	Если НайденныеСтроки.Количество() = 0 Тогда
		НоваяСтрока = ТаблицаПодбора.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураОтбора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ТаблицаПодбора.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Если Назначение = "Сотрудники" Тогда
		Если СписокСотрудников.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен список сотрудников", , "СписокСотрудников");
			Возврат;
		КонецЕсли;
	ИначеЕсли Назначение = "Бригады" Тогда
		Если СписокБригад.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен список бригад", , "СписокБригад");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТаблицаПодбора.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Таблица подбора пустая", , "ТаблицаПодбора");
		Возврат;
	КонецЕсли;
		
	ПеренестиВДокумент = Истина;
	Закрыть(КодВозвратаДиалога.OK);
	
КонецПроцедуры

#КонецОбласти


#Область Прочее

&НаСервере
Функция АдресТаблицыВХранилище(УникальныйИдентификаторВладельца)
	
	АдресВХранилище = Неопределено;
	
	Если ПеренестиВДокумент Тогда
		ТЗ_ТаблицаПодбора = ТаблицаПодбора.Выгрузить();

		АдресВХранилище = ПоместитьВоВременноеХранилище(ТЗ_ТаблицаПодбора, УникальныйИдентификаторВладельца);	
	КонецЕсли;
	
	Возврат АдресВХранилище;
	
КонецФункции

#КонецОбласти
